print('Введите текст:')
st = str(input())
st1 = st.lower()
k1 = 0
k2 = 0
for i in range(len(st1)):
    if st1[i] == 'ж' or st1[i] == 'ш':
        if st1[i+1] == 'и':
            k1 = k1
        elif st1[i+1] == 'ы':
            k1 = k1 + 1
    elif st1[i] == 'ч' or st1[i] == 'щ':
        if st1[i+1] == 'а':
            k2 = k2
        elif st1[i+1] == 'я':
            k2 = k2 + 1
if k1 > 0:
    print('Проверьте правильность написания "жи" и "ши" в тексте')
else:
    print('Буквосочетания "жи" и "ши" в тексте написаны правильно')
if k2 > 0:
    print('Проверьте правильность написания "ча" и "ща" в тексте')
else:
    print('Буквосочетания "ча" и "ща" в тексте написаны правильно')

